public class Main {
    public static void main(String[] args) {
        int mile = 20;
        int bilet = 5000;
        int bonus = bilet / mile; // 250
        System.out.println(bonus);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

    }
}
